// Логічні оператори
// // Що виведе код?

// console.log(true && 3);

// console.log(false && 3);

// console.log(true && 4 && "hello");

// console.log(true && 0 && "hello");

// console.log(true || 3);

// console.log(true || 3 || 4);

// console.log(true || false || 7);

// console.log(null || 2 || undefined);

// console.log(null || 2 && 3 || 4);


// ................
// Задачка на оператор перевірки цлого числа

// Написати програму яка отримує від користувача число
// і визначає парне це число або непарне.

// ....................................

// Розбір ДЗ №4

// Задача №3
// if...else і prompt
// //Використавши інструкцію if..else, напиши код, який буде питатись:
// «Яка кількість місяців в році».
//  Якщо користувач вводить 12,
// то показати: «Вірно!»,
// в протилежному випадку – вивести відповідь:
// «Не вірно!»
let userMonse = Number(prompt('Яка кількість місяців в році')) 
if(userMonse === 12){
    console.log('Вірно')
}else{
    console.log('Не вірно')
}


// .................
// Задача №4
// написати програму яка питає у користувача період підписки
// на сервіс і показувати ціну підписки
// спочатку if else prompt
// потім switch


// Якщо ввів День - ціна 1.99
// Якщо Тиждень - ціна 5.99
// Якщо місяць - ціна 10.99
// Якщо рік - ціна 100.99

// .....................
// Задача№5
// Тернарний оператор
// // Перепиши if...else з використанням тернарного оператора.

// const a = 1;
// const b = 2;
// let result;

// if (a + b < 4) {
//   result = 'Мало';
// } else {
//   result = 'Багато';
// }



// console.log(result);





